FlashForge-C5-Modding-Group/klipper-c5/src/stm32/gd32h7.h
#ifndef __GD32H7_H
#define __GD32H7_H

#include <stddef.h>
#include <stdint.h>

// Cortex-M7 device facts consumed by the repository CMSIS core.
#define __CM7_REV                 0x0102U
#define __MPU_PRESENT             1U
#define __NVIC_PRIO_BITS          4U
#define __Vendor_SysTickConfig    0U
#define __FPU_PRESENT             1U
#define __ICACHE_PRESENT          1U
#define __DCACHE_PRESENT          1U

typedef enum {
    SysTick_IRQn = -1,
    DMA0_Channel0_IRQn = 11,
    DMA0_Channel1_IRQn = 12,
    ADC0_1_IRQn = 18,
    USART0_IRQn = 37,
} IRQn_Type;

#include "core_cm7.h"

#define REG32(addr) (*(volatile uint32_t *)(uint32_t)(addr))
#define BIT(x) ((uint32_t)((uint32_t)0x01U << (x)))
#define BITS(start, end) \
    ((0xffffffffUL << (start)) & (0xffffffffUL >> (31U - (uint32_t)(end))))

typedef struct {
    __IO uint32_t MODER;
    __IO uint32_t OTYPER;
    __IO uint32_t OSPEEDR;
    __IO uint32_t PUPDR;
    __I  uint32_t IDR;
    __IO uint32_t ODR;
    __O  uint32_t BOP;
    __IO uint32_t LCKR;
    __IO uint32_t AFR[2];
    __O  uint32_t BC;
    __O  uint32_t TG;
} GPIO_TypeDef;

typedef struct {
    __IO uint32_t CTL0;
    __IO uint32_t CTL1;
    __IO uint32_t CTL2;
    __IO uint32_t BAUD;
    __IO uint32_t GP;
    __IO uint32_t RT;
    __O  uint32_t CMD;
    __I  uint32_t STAT;
    __O  uint32_t INTC;
    __I  uint32_t RDATA;
    __O  uint32_t TDATA;
} USART_TypeDef;

#define APB1_BUS_BASE         ((uint32_t)0x40000000U)
#define APB2_BUS_BASE         ((uint32_t)0x40010000U)
#define APB4_BUS_BASE         ((uint32_t)0x58000000U)
#define AHB1_BUS_BASE         ((uint32_t)0x40020000U)
#define AHB4_BUS_BASE         ((uint32_t)0x58020000U)

#define TIMER_BASE            (APB1_BUS_BASE + 0x00000000U)
#define USART_BASE            (APB1_BUS_BASE + 0x00004400U)
#define ADC_BASE              (APB2_BUS_BASE + 0x00002400U)
#define TRIGSEL_BASE          (APB2_BUS_BASE + 0x00008400U)
#define SYSCFG_BASE           (APB4_BUS_BASE + 0x00000400U)
#define FWDGT_BASE            (APB4_BUS_BASE + 0x00004800U)
#define DMA_BASE              (AHB1_BUS_BASE + 0x00000000U)
#define DMAMUX_BASE           (AHB1_BUS_BASE + 0x00000800U)
#define GPIO_BASE             (AHB4_BUS_BASE + 0x00000000U)
#define RCU_BASE              (AHB4_BUS_BASE + 0x00004400U)

#define TIMER1                (TIMER_BASE + 0x00000000U)
#define TIMER2                (TIMER_BASE + 0x00000400U)
#define TIMER3                (TIMER_BASE + 0x00000800U)
#define TIMER4                (TIMER_BASE + 0x00000C00U)
#define TIMER7                (TIMER_BASE + 0x00010400U)
#define TIMER22               (TIMER_BASE + 0x0000E000U)
#define ADC0                  ADC_BASE
#define ADC1                  (ADC_BASE + 0x00000400U)
#define ADC2                  (ADC_BASE + 0x00000800U)
#define DMA0                  DMA_BASE
#define DMAMUX                DMAMUX_BASE
#define TRIGSEL               TRIGSEL_BASE
#define SYSCFG                SYSCFG_BASE
#define RCU                   RCU_BASE
#define FWDGT                 FWDGT_BASE

#define GPIOA_BASE            (GPIO_BASE + 0x00000000U)
#define GPIOB_BASE            (GPIO_BASE + 0x00000400U)
#define GPIOC_BASE            (GPIO_BASE + 0x00000800U)
#define GPIOD_BASE            (GPIO_BASE + 0x00000C00U)
#define GPIOE_BASE            (GPIO_BASE + 0x00001000U)
#define USART0_BASE           (USART_BASE + 0x0000CC00U)

#define GPIOA                 ((GPIO_TypeDef *)GPIOA_BASE)
#define GPIOB                 ((GPIO_TypeDef *)GPIOB_BASE)
#define GPIOC                 ((GPIO_TypeDef *)GPIOC_BASE)
#define GPIOD                 ((GPIO_TypeDef *)GPIOD_BASE)
#define GPIOE                 ((GPIO_TypeDef *)GPIOE_BASE)
#define USART0                ((USART_TypeDef *)USART0_BASE)

// Reset and clock unit.
#define RCU_CTL               REG32(RCU + 0x00000000U)
#define RCU_PLL0              REG32(RCU + 0x00000004U)
#define RCU_CFG0              REG32(RCU + 0x00000008U)
#define RCU_INT               REG32(RCU + 0x0000000CU)
#define RCU_AHB4RST           REG32(RCU + 0x0000001CU)
#define RCU_APB1RST           REG32(RCU + 0x00000020U)
#define RCU_APB2RST           REG32(RCU + 0x00000024U)
#define RCU_AHB1EN            REG32(RCU + 0x00000030U)
#define RCU_AHB4EN            REG32(RCU + 0x0000003CU)
#define RCU_APB1EN            REG32(RCU + 0x00000040U)
#define RCU_APB2EN            REG32(RCU + 0x00000044U)
#define RCU_APB4EN            REG32(RCU + 0x0000004CU)
#define RCU_RSTSCK            REG32(RCU + 0x00000074U)
#define RCU_PLLADDCTL         REG32(RCU + 0x00000080U)
#define RCU_PLL1              REG32(RCU + 0x00000084U)
#define RCU_PLL2              REG32(RCU + 0x00000088U)
#define RCU_CFG1              REG32(RCU + 0x0000008CU)
#define RCU_PLLALL            REG32(RCU + 0x00000098U)
#define RCU_PLL0FRA           REG32(RCU + 0x0000009CU)
#define RCU_PLL1FRA           REG32(RCU + 0x000000A0U)
#define RCU_PLL2FRA           REG32(RCU + 0x000000A4U)
#define RCU_PLL0_RESET_VALUE ((uint32_t)0x01002020U)
#define RCU_PLL1_RESET_VALUE ((uint32_t)0x01012020U)
#define RCU_PLL2_RESET_VALUE ((uint32_t)0x01012020U)
#define RCU_INT_RESET_VALUE  ((uint32_t)0x14FF0000U)

#define RCU_CTL_HXTALEN       BIT(16)
#define RCU_CTL_HXTALSTB      BIT(17)
#define RCU_CTL_PLL0EN        BIT(24)
#define RCU_CTL_PLL0STB       BIT(25)
#define RCU_CTL_PLL1EN        BIT(26)
#define RCU_CTL_PLL1STB       BIT(27)
#define RCU_CTL_PLL2EN        BIT(28)
#define RCU_CTL_PLL2STB       BIT(29)
#define RCU_CTL_IRC64MEN      BIT(30)
#define RCU_CTL_IRC64MSTB     BIT(31)
#define RCU_CFG0_SCS          BITS(0, 1)
#define RCU_CFG0_SCSS         BITS(2, 3)
#define RCU_CFG1_USART0SEL    BITS(0, 1)
#define RCU_PLLADDCTL_PLL0Q   BITS(0, 6)
#define RCU_PLLADDCTL_PLL0QEN BIT(23)
#define RCU_PLLADDCTL_PLL0REN BIT(24)
#define RCU_PLLADDCTL_PLL0PEN BIT(25)
#define RCU_RSTSCK_IRC32KEN   BIT(0)
#define RCU_RSTSCK_IRC32KSTB  BIT(1)

#define CFG0_SCS(regval) \
    (BITS(0, 1) & ((uint32_t)(regval) << 0U))
#define CFG0_SCSS(regval) \
    (BITS(2, 3) & ((uint32_t)(regval) << 2U))
#define CFG0_AHBPSC(regval) \
    (BITS(4, 7) & ((uint32_t)(regval) << 4U))
#define CFG0_APB1PSC(regval) \
    (BITS(10, 12) & ((uint32_t)(regval) << 10U))
#define CFG0_APB2PSC(regval) \
    (BITS(13, 15) & ((uint32_t)(regval) << 13U))
#define CFG0_APB3PSC(regval) \
    (BITS(27, 29) & ((uint32_t)(regval) << 27U))
#define CFG0_APB4PSC(regval) \
    (BITS(24, 26) & ((uint32_t)(regval) << 24U))
#define RCU_CKSYSSRC_PLL0P   CFG0_SCS(3)
#define RCU_SCSS_PLL0P       CFG0_SCSS(3)
#define RCU_AHB_CKSYS_DIV2   CFG0_AHBPSC(8)
#define RCU_APB1_CKAHB_DIV2  CFG0_APB1PSC(4)
#define RCU_APB2_CKAHB_DIV1  CFG0_APB2PSC(0)
#define RCU_APB3_CKAHB_DIV2  CFG0_APB3PSC(4)
#define RCU_APB4_CKAHB_DIV2  CFG0_APB4PSC(4)
#define CFG1_USART0SEL(regval) \
    (BITS(0, 1) & ((uint32_t)(regval) << 0U))
#define RCU_USARTSRC_APB     CFG1_USART0SEL(0)
#define PLLALL_PLLSEL(regval) \
    (BITS(16, 17) & ((uint32_t)(regval) << 16U))
#define PLLALL_PLL0RNG(regval) \
    (BITS(0, 1) & ((uint32_t)(regval) << 0U))
#define RCU_PLLSRC_HXTAL     PLLALL_PLLSEL(2)
#define RCU_PLL0RNG_4M_8M    PLLALL_PLL0RNG(2)
#define RCU_PLLNOFFSET       ((uint32_t)6U)
#define RCU_PLLPOFFSET       ((uint32_t)16U)
#define RCU_PLLROFFSET       ((uint32_t)24U)
#define RCU_PLL0P            RCU_PLLADDCTL_PLL0PEN
#define RCU_PLL0Q            RCU_PLLADDCTL_PLL0QEN
#define RCU_PLL0R            RCU_PLLADDCTL_PLL0REN

#define RCU_AHB4EN_PAEN       BIT(0)
#define RCU_AHB4EN_PBEN       BIT(1)
#define RCU_AHB4EN_PCEN       BIT(2)
#define RCU_AHB4EN_PDEN       BIT(3)
#define RCU_AHB4EN_PEEN       BIT(4)
#define RCU_AHB4RST_PARST     BIT(0)
#define RCU_AHB4RST_PBRST     BIT(1)
#define RCU_AHB4RST_PCRST     BIT(2)
#define RCU_AHB4RST_PDRST     BIT(3)
#define RCU_AHB4RST_PERST     BIT(4)
#define RCU_APB1EN_TIMER1EN  BIT(0)
#define RCU_APB1EN_TIMER2EN  BIT(1)
#define RCU_APB1EN_TIMER3EN  BIT(2)
#define RCU_APB1EN_TIMER4EN  BIT(3)
#define RCU_APB1EN_TIMER22EN BIT(6)
#define RCU_APB1RST_TIMER1RST BIT(0)
#define RCU_APB1RST_TIMER2RST BIT(1)
#define RCU_APB1RST_TIMER3RST BIT(2)
#define RCU_APB1RST_TIMER4RST BIT(3)
#define RCU_APB1RST_TIMER22RST BIT(6)
#define RCU_APB2EN_TIMER7EN   BIT(1)
#define RCU_APB2EN_USART0EN   BIT(4)
#define RCU_APB2EN_ADC0EN     BIT(8)
#define RCU_APB2EN_ADC1EN     BIT(9)
#define RCU_APB2EN_ADC2EN     BIT(10)
#define RCU_APB2RST_TIMER7RST BIT(1)
#define RCU_APB2RST_USART0RST BIT(4)
#define RCU_APB2RST_ADC0RST   BIT(8)
#define RCU_APB2RST_ADC1RST   BIT(9)
#define RCU_APB2RST_ADC2RST   BIT(10)
#define RCU_AHB1EN_DMA0EN     BIT(21)
#define RCU_AHB1EN_DMAMUXEN   BIT(23)
#define RCU_APB2EN_TRGSELEN   BIT(31)
#define RCU_APB4EN_SYSCFGEN   BIT(0)

// System configuration controller.
#define SYSCFG_SRAMCFG1      REG32(SYSCFG + 0x00000068U)
#define SYSCFG_SRAMCFG1_TCM_WAITSTATE BIT(0)
#define SYSCFG_TIMERCFG_TSCFG5 BITS(26, 30)
#define SYSCFG_TIMERCFG0(syscfg_timerx) \
    REG32(SYSCFG + 0x100U + (syscfg_timerx) * 0x0CU)
#define SYSCFG_TIMERCFG1(syscfg_timerx) \
    REG32(SYSCFG + 0x104U + (syscfg_timerx) * 0x0CU)
#define SYSCFG_TIMERCFG2(syscfg_timerx) \
    REG32(SYSCFG + 0x108U + (syscfg_timerx) * 0x0CU)
#define SYSCFG_TIMERCFG_TSCFG5_VALUE(regval) \
    (SYSCFG_TIMERCFG_TSCFG5 & ((uint32_t)(regval) << 26U))
#define SYSCFG_TIMER0       ((uint8_t)0x00U)
#define SYSCFG_TIMER1       ((uint8_t)0x01U)
#define SYSCFG_TIMER3       ((uint8_t)0x03U)
#define SYSCFG_TIMER4       ((uint8_t)0x04U)
#define SYSCFG_TIMER7       ((uint8_t)0x05U)
#define TIMER_SMCFG_TRGSEL_ITI2  ((uint8_t)0x03U)
#define TIMER_SMCFG_TRGSEL_ITI14 ((uint8_t)0x13U)

// Timer registers and fields.
#define TIMER_CTL0(timerx)        REG32((timerx) + 0x00000000U)
#define TIMER_CTL1(timerx)        REG32((timerx) + 0x00000004U)
#define TIMER_SMCFG(timerx)       REG32((timerx) + 0x00000008U)
#define TIMER_SWEVG(timerx)       REG32((timerx) + 0x00000014U)
#define TIMER_CHCTL0(timerx)      REG32((timerx) + 0x00000018U)
#define TIMER_CHCTL1(timerx)      REG32((timerx) + 0x0000001CU)
#define TIMER_CHCTL2(timerx)      REG32((timerx) + 0x00000020U)
#define TIMER_CNT(timerx)         REG32((timerx) + 0x00000024U)
#define TIMER_PSC(timerx)         REG32((timerx) + 0x00000028U)
#define TIMER_CAR(timerx)         REG32((timerx) + 0x0000002CU)
#define TIMER_CREP0(timerx)       REG32((timerx) + 0x00000030U)
#define TIMER_CH0CV(timerx)       REG32((timerx) + 0x00000034U)
#define TIMER_CH1CV(timerx)       REG32((timerx) + 0x00000038U)
#define TIMER_CH2CV(timerx)       REG32((timerx) + 0x0000003CU)
#define TIMER_CH3CV(timerx)       REG32((timerx) + 0x00000040U)
#define TIMER_CCHP(timerx)        REG32((timerx) + 0x00000044U)
#define TIMER_CH0COMV_ADD(timerx) REG32((timerx) + 0x00000064U)
#define TIMER_CH1COMV_ADD(timerx) REG32((timerx) + 0x00000068U)
#define TIMER_CH2COMV_ADD(timerx) REG32((timerx) + 0x0000006CU)
#define TIMER_CH3COMV_ADD(timerx) REG32((timerx) + 0x00000070U)
#define TIMER_CTL2(timerx)        REG32((timerx) + 0x00000074U)
#define TIMER_CFG(timerx)         REG32((timerx) + 0x000000FCU)

