FlashForge-C5-Modding-Group/klipper-c5/src/stm32/gd32h7.h
#define TIMER_CTL0_CEN            BIT(0)
#define TIMER_CTL0_DIR            BIT(4)
#define TIMER_CTL0_CAM            BITS(5, 6)
#define TIMER_CTL0_CKDIV          BITS(8, 9)
#define TIMER_CTL1_MMC0           BITS(4, 6)
#define TIMER_CTL1_ISO0           BIT(8)
#define TIMER_CTL1_ISO0N          BIT(9)
#define TIMER_CTL1_ISO1           BIT(10)
#define TIMER_CTL1_ISO1N          BIT(11)
#define TIMER_CTL1_ISO2           BIT(12)
#define TIMER_CTL1_ISO2N          BIT(13)
#define TIMER_CTL1_ISO3           BIT(14)
#define TIMER_CTL1_ISO3N          BIT(15)
#define TIMER_SMCFG_MSM           BIT(7)
#define TIMER_SWEVG_UPG           BIT(0)
#define TIMER_CHCTL0_CH0MS        (BITS(0, 1) | BIT(30))
#define TIMER_CHCTL0_CH0COMSEN    BIT(3)
#define TIMER_CHCTL0_CH0COMCTL    (BITS(4, 6) | BIT(16))
#define TIMER_CHCTL0_CH1MS        (BITS(8, 9) | BIT(31))
#define TIMER_CHCTL0_CH1COMSEN    BIT(11)
#define TIMER_CHCTL0_CH1COMCTL    (BITS(12, 14) | BIT(24))
#define TIMER_CHCTL0_CH0COMADDSEN BIT(28)
#define TIMER_CHCTL0_CH1COMADDSEN BIT(29)
#define TIMER_CHCTL1_CH2MS        (BITS(0, 1) | BIT(30))
#define TIMER_CHCTL1_CH2COMSEN    BIT(3)
#define TIMER_CHCTL1_CH2COMCTL    (BITS(4, 6) | BIT(16))
#define TIMER_CHCTL1_CH3MS        (BITS(8, 9) | BIT(31))
#define TIMER_CHCTL1_CH3COMSEN    BIT(11)
#define TIMER_CHCTL1_CH3COMCTL    (BITS(12, 14) | BIT(24))
#define TIMER_CHCTL1_CH2COMADDSEN BIT(28)
#define TIMER_CHCTL1_CH3COMADDSEN BIT(29)
#define TIMER_CHCTL2_CH0EN        BIT(0)
#define TIMER_CHCTL2_CH0P         BIT(1)
#define TIMER_CHCTL2_CH0NEN       BIT(2)
#define TIMER_CHCTL2_CH0NP        BIT(3)
#define TIMER_CHCTL2_CH1EN        BIT(4)
#define TIMER_CHCTL2_CH1P         BIT(5)
#define TIMER_CHCTL2_CH1NEN       BIT(6)
#define TIMER_CHCTL2_CH1NP        BIT(7)
#define TIMER_CHCTL2_CH2EN        BIT(8)
#define TIMER_CHCTL2_CH2P         BIT(9)
#define TIMER_CHCTL2_CH2NEN       BIT(10)
#define TIMER_CHCTL2_CH2NP        BIT(11)
#define TIMER_CHCTL2_CH3EN        BIT(12)
#define TIMER_CHCTL2_CH3P         BIT(13)
#define TIMER_CHCTL2_CH3NEN       BIT(14)
#define TIMER_CHCTL2_CH3NP        BIT(15)
#define TIMER_CCHP_POEN           BIT(15)
#define TIMER_CTL2_CH0CPWMEN      BIT(28)
#define TIMER_CTL2_CH1CPWMEN      BIT(29)
#define TIMER_CTL2_CH2CPWMEN      BIT(30)
#define TIMER_CTL2_CH3CPWMEN      BIT(31)
#define TIMER_CFG_CREPSEL         BIT(2)
#define TIMER_OC_MODE_PWM0        ((uint32_t)0x00000060U)
#define TIMER_OC_MODE_PWM1        ((uint32_t)0x00000070U)
#define TIMER_TRI_OUT0_SRC_ENABLE (BITS(4, 6) & ((uint32_t)1U << 4U))
#define TIMER_CHCTL0_CH0COMCTL_VALUE(value) \
    ((uint32_t)(value) & TIMER_CHCTL0_CH0COMCTL)
#define TIMER_CHCTL0_CH1COMCTL_VALUE(value) \
    (((uint32_t)(value) << 8U) & TIMER_CHCTL0_CH1COMCTL)
#define TIMER_CHCTL1_CH2COMCTL_VALUE(value) \
    ((uint32_t)(value) & TIMER_CHCTL1_CH2COMCTL)
#define TIMER_CHCTL1_CH3COMCTL_VALUE(value) \
    (((uint32_t)(value) << 8U) & TIMER_CHCTL1_CH3COMCTL)

// ADC registers and fields.
#define ADC_STAT(adcx)      REG32((adcx) + 0x00000000U)
#define ADC_CTL0(adcx)      REG32((adcx) + 0x00000004U)
#define ADC_CTL1(adcx)      REG32((adcx) + 0x00000008U)
#define ADC_RSQ0(adcx)      REG32((adcx) + 0x00000024U)
#define ADC_RSQ7(adcx)      REG32((adcx) + 0x00000040U)
#define ADC_RSQ8(adcx)      REG32((adcx) + 0x00000044U)
#define ADC_ISQ0(adcx)      REG32((adcx) + 0x00000048U)
#define ADC_ISQ1(adcx)      REG32((adcx) + 0x0000004CU)
#define ADC_IDATA0(adcx)    REG32((adcx) + 0x00000054U)
#define ADC_IDATA1(adcx)    REG32((adcx) + 0x00000058U)
#define ADC_RDATA(adcx)     REG32((adcx) + 0x00000064U)
#define ADC_SYNCCTL(adcx)   REG32((adcx) + 0x00000304U)

#define ADC_STAT_EOC        BIT(1)
#define ADC_STAT_EOIC       BIT(2)
#define ADC_CTL0_EOICIE     BIT(7)
#define ADC_CTL0_SM         BIT(8)
#define ADC_CTL0_DRES       BITS(24, 25)
#define ADC_CTL1_ADCON      BIT(0)
#define ADC_CTL1_CLB        BIT(2)
#define ADC_CTL1_RSTCLB     BIT(3)
#define ADC_CTL1_CALNUM     BITS(4, 6)
#define ADC_CTL1_DMA        BIT(8)
#define ADC_CTL1_DDM        BIT(9)
#define ADC_CTL1_DAL        BIT(11)
#define ADC_CTL1_ETMIC      BITS(20, 21)
#define ADC_CTL1_CALMOD     BIT(27)
#define ADC_CTL1_ETMRC      BITS(28, 29)
#define ADC_CTL1_SWRCST     BIT(30)
#define ADC_RSQX_RSQN       BITS(0, 4)
#define ADC_RSQX_RSMPN      BITS(5, 14)
#define ADC_RSQ0_RL         BITS(20, 23)
#define ADC_ISQX_ISQN       BITS(0, 4)
#define ADC_ISQX_ISMPN      BITS(5, 14)
#define ADC_ISQ0_IL         BITS(20, 21)
#define ADC_SYNCCTL_ADCSCK  BITS(16, 19)
#define ADC_SYNCCTL_ADCCK   BITS(20, 23)
#define SQX_SMP(regval) \
    (BITS(5, 14) & ((uint32_t)(regval) << 5U))
#define RSQ0_RL(regval) \
    (BITS(20, 23) & ((uint32_t)(regval) << 20U))
#define ISQ0_IL(regval) \
    (BITS(20, 21) & ((uint32_t)(regval) << 20U))
#define SYNCCTL_ADCSCK(regval) \
    (BITS(16, 19) & ((uint32_t)(regval) << 16U))
#define SYNCCTL_ADCCK(regval) \
    (BITS(20, 23) & ((uint32_t)(regval) << 20U))
#define ADC_CLK_SYNC_HCLK_DIV4 \
    (SYNCCTL_ADCCK(0) | SYNCCTL_ADCSCK(9))
#define ADC_CLK_SYNC_HCLK_DIV6 \
    (SYNCCTL_ADCCK(0) | SYNCCTL_ADCSCK(10))
#define EXTERNAL_TRIGGER_RISING ((uint32_t)0x00000001U)
#define ROUTINE_TRIGGER_MODE    ((uint8_t)28U)
#define INSERTED_TRIGGER_MODE   ((uint8_t)20U)
#define ADC_INSERTED_CHANNEL_SHIFT_LENGTH ((uint8_t)16U)

// DMA and DMAMUX registers and fields.
#define DMA_INTF0(dmax)          REG32((dmax) + 0x00000000U)
#define DMA_INTC0(dmax)          REG32((dmax) + 0x00000008U)
#define DMA_CHCTL(dma, channel) \
    REG32(((dma) + 0x00000010U) + 0x00000018U * (channel))
#define DMA_CHCNT(dma, channel) \
    REG32(((dma) + 0x00000014U) + 0x00000018U * (channel))
#define DMA_CHPADDR(dma, channel) \
    REG32(((dma) + 0x00000018U) + 0x00000018U * (channel))
#define DMA_CHM0ADDR(dma, channel) \
    REG32(((dma) + 0x0000001CU) + 0x00000018U * (channel))
#define DMA_CHM1ADDR(dma, channel) \
    REG32(((dma) + 0x00000020U) + 0x00000018U * (channel))
#define DMA_CHFCTL(dma, channel) \
    REG32(((dma) + 0x00000024U) + 0x00000018U * (channel))
#define DMAMUX_RM_CHXCFG(channel) \
    REG32(DMAMUX + 0x04U * (uint32_t)(channel))

