FlashForge-C5-Modding-Group/klipper-c5/src/stm32/gd32h7.h
#define DMA_INTF_FTFIF          BIT(5)
#define DMA_INTC_FEEIFC         BIT(0)
#define DMA_INTC_SDEIFC         BIT(2)
#define DMA_INTC_TAEIFC         BIT(3)
#define DMA_INTC_HTFIFC         BIT(4)
#define DMA_INTC_FTFIFC         BIT(5)
#define DMA_CHXCTL_CHEN         BIT(0)
#define DMA_CHXCTL_FTFIE        BIT(4)
#define DMA_CHXCTL_CMEN         BIT(8)
#define DMA_CHXCTL_MNAGA        BIT(10)
#define DMA_CHXCTL_PWIDTH       BITS(11, 12)
#define DMA_CHXCTL_MWIDTH       BITS(13, 14)
#define DMA_CHXCTL_PRIO         BITS(16, 17)
#define DMAMUX_RM_CHXCFG_MUXID  BITS(0, 7)
#define DMA_FLAG_ADD(flag, channel) \
    ((uint32_t)((flag) << ((((uint32_t)(channel) * 6U)) \
     + ((uint32_t)(((uint32_t)(channel)) >> 1U) & 0x01U) * 4U)))
#define CHCTL_PRIO(regval) \
    (DMA_CHXCTL_PRIO & ((uint32_t)(regval) << 16U))
#define CHCTL_MWIDTH(regval) \
    (DMA_CHXCTL_MWIDTH & ((uint32_t)(regval) << 13U))
#define CHCTL_PWIDTH(regval) \
    (DMA_CHXCTL_PWIDTH & ((uint32_t)(regval) << 11U))
#define DMA_PRIORITY_ULTRA_HIGH CHCTL_PRIO(3)
#define DMA_MEMORY_WIDTH_32BIT  CHCTL_MWIDTH(2)
#define DMA_PERIPH_WIDTH_32BIT  CHCTL_PWIDTH(2)
#define RM_CHXCFG_MUXID(regval) \
    (BITS(0, 7) & ((uint32_t)(regval) << 0U))
#define DMA_REQUEST_ADC0        RM_CHXCFG_MUXID(9U)
#define DMA_REQUEST_ADC1        RM_CHXCFG_MUXID(10U)

// Trigger selector registers and descriptors.
#define TRIGSEL_TIMER7ITI14     REG32(TRIGSEL + 0x000000A0U)
#define TRIGSEL_TARGET_LK       BIT(31)
#define TRIGSEL_TARGET_REG(target_periph) \
    REG32(TRIGSEL + ((uint32_t)(target_periph) & BITS(2, 31)))
#define TRIGSEL_TARGET_PERIPH_SHIFT(target_periph) \
    (((uint32_t)(target_periph) & BITS(0, 1)) << 3U)
#define TRIGSEL_TARGET_PERIPH_MASK(target_periph) \
    ((uint32_t)(BITS(0, 7) << TRIGSEL_TARGET_PERIPH_SHIFT(target_periph)))
#define TRIGSEL_INPUT_TIMER2_CH0 ((uint8_t)0x2CU)
#define TRIGSEL_INPUT_TIMER2_CH1 ((uint8_t)0x2DU)
#define TRIGSEL_INPUT_TIMER2_CH2 ((uint8_t)0x2EU)
#define TRIGSEL_INPUT_TIMER2_CH3 ((uint8_t)0x2FU)
#define TRIGSEL_INPUT_TIMER4_CH0 ((uint8_t)0x38U)
#define TRIGSEL_INPUT_TIMER4_CH1 ((uint8_t)0x39U)
#define TRIGSEL_INPUT_TIMER4_CH2 ((uint8_t)0x3AU)
#define TRIGSEL_INPUT_TIMER4_CH3 ((uint8_t)0x3BU)
#define TRIGSEL_OUTPUT_ADC0_ROUTRG  ((uint8_t)0x10U)
#define TRIGSEL_OUTPUT_ADC0_INSTRG  ((uint8_t)0x11U)
#define TRIGSEL_OUTPUT_ADC1_ROUTRG  ((uint8_t)0x14U)
#define TRIGSEL_OUTPUT_ADC1_INSTRG  ((uint8_t)0x15U)
#define TRIGSEL_OUTPUT_TIMER0_ITI14 ((uint8_t)0x8CU)
#define TRIGSEL_OUTPUT_TIMER1_ITI14 ((uint8_t)0x90U)
#define TRIGSEL_OUTPUT_TIMER3_ITI14 ((uint8_t)0x98U)
#define TRIGSEL_OUTPUT_TIMER7_ITI14 ((uint8_t)0xA0U)

// USART fields.
#define USART_CTL0_UEN          BIT(0)
#define USART_CTL0_REN          BIT(2)
#define USART_CTL0_TEN          BIT(3)
#define USART_CTL0_RBNEIE       BIT(5)
#define USART_CTL0_TBEIE        BIT(7)
#define USART_STAT_PERR         BIT(0)
#define USART_STAT_FERR         BIT(1)
#define USART_STAT_NERR         BIT(2)
#define USART_STAT_ORERR        BIT(3)
#define USART_STAT_RBNE         BIT(5)
#define USART_STAT_TBE          BIT(7)
#define USART_INTC_PEC          BIT(0)
#define USART_INTC_FEC          BIT(1)
#define USART_INTC_NEC          BIT(2)
#define USART_INTC_OREC         BIT(3)

// Free watchdog.
#define FWDGT_CTL               REG32(FWDGT + 0x00000000U)
#define FWDGT_PSC               REG32(FWDGT + 0x00000004U)
#define FWDGT_RLD               REG32(FWDGT + 0x00000008U)
#define FWDGT_STAT              REG32(FWDGT + 0x0000000CU)
#define FWDGT_WND               REG32(FWDGT + 0x00000010U)
#define FWDGT_STAT_PUD          BIT(0)
#define FWDGT_STAT_RUD          BIT(1)
#define FWDGT_STAT_WUD          BIT(2)
#define FWDGT_RLD_RLD           BITS(0, 11)
#define FWDGT_WND_WND           BITS(0, 11)
#define FWDGT_PSC_DIV4          ((uint8_t)0U)
#define FWDGT_WRITEACCESS_ENABLE ((uint16_t)0x5555U)
#define FWDGT_KEY_RELOAD         ((uint16_t)0xAAAAU)
#define FWDGT_KEY_ENABLE         ((uint16_t)0xCCCCU)

_Static_assert(offsetof(GPIO_TypeDef, MODER) == 0x00U
               && offsetof(GPIO_TypeDef, OTYPER) == 0x04U
               && offsetof(GPIO_TypeDef, OSPEEDR) == 0x08U
               && offsetof(GPIO_TypeDef, PUPDR) == 0x0CU
               && offsetof(GPIO_TypeDef, IDR) == 0x10U
               && offsetof(GPIO_TypeDef, ODR) == 0x14U
               && offsetof(GPIO_TypeDef, BOP) == 0x18U
               && offsetof(GPIO_TypeDef, LCKR) == 0x1CU
               && offsetof(GPIO_TypeDef, AFR) == 0x20U
               && offsetof(GPIO_TypeDef, BC) == 0x28U
               && offsetof(GPIO_TypeDef, TG) == 0x2CU,
               "GD32H7 GPIO register layout mismatch");
_Static_assert(offsetof(USART_TypeDef, CTL0) == 0x00U
               && offsetof(USART_TypeDef, CTL1) == 0x04U
               && offsetof(USART_TypeDef, CTL2) == 0x08U
               && offsetof(USART_TypeDef, BAUD) == 0x0CU
               && offsetof(USART_TypeDef, GP) == 0x10U
               && offsetof(USART_TypeDef, RT) == 0x14U
               && offsetof(USART_TypeDef, CMD) == 0x18U
               && offsetof(USART_TypeDef, STAT) == 0x1CU
               && offsetof(USART_TypeDef, INTC) == 0x20U
               && offsetof(USART_TypeDef, RDATA) == 0x24U
               && offsetof(USART_TypeDef, TDATA) == 0x28U,
               "GD32H7 USART register layout mismatch");
_Static_assert(RCU_BASE == 0x58024400U && SYSCFG_BASE == 0x58000400U
               && DMA0 == 0x40020000U && DMAMUX == 0x40020800U
               && TRIGSEL == 0x40018400U && ADC0 == 0x40012400U,
               "GD32H7 critical peripheral bases mismatch");
_Static_assert((uintptr_t)&RCU_CTL == 0x58024400U
               && (uintptr_t)&RCU_PLL1 == 0x58024484U
               && (uintptr_t)&RCU_PLL2 == 0x58024488U
               && (uintptr_t)&RCU_CFG1 == 0x5802448CU,
               "GD32H7 RCU register addresses mismatch");
_Static_assert((uintptr_t)&TIMER_SWEVG(TIMER2) == 0x40000414U
               && (uintptr_t)&TIMER_CH0COMV_ADD(TIMER7) == 0x40010464U
               && (uintptr_t)&ADC_RSQ8(ADC2) == 0x40012C44U
               && (uintptr_t)&ADC_SYNCCTL(ADC0) == 0x40012704U,
               "GD32H7 timer/ADC register addresses mismatch");
_Static_assert((uintptr_t)&DMA_CHCTL(DMA0, 1) == 0x40020028U
               && (uintptr_t)&DMAMUX_RM_CHXCFG(1) == 0x40020804U
               && (uintptr_t)&SYSCFG_TIMERCFG0(SYSCFG_TIMER7) == 0x5800053CU
               && (uintptr_t)&TRIGSEL_TIMER7ITI14 == 0x400184A0U,
               "GD32H7 DMA/routing register addresses mismatch");
_Static_assert((uintptr_t)&FWDGT_WND == 0x58004810U,
               "GD32H7 FWDGT register address mismatch");
_Static_assert(RCU_AHB4EN_PAEN == RCU_AHB4RST_PARST
               && RCU_AHB4EN_PBEN == RCU_AHB4RST_PBRST
               && RCU_AHB4EN_PCEN == RCU_AHB4RST_PCRST
               && RCU_AHB4EN_PDEN == RCU_AHB4RST_PDRST
               && RCU_AHB4EN_PEEN == RCU_AHB4RST_PERST
               && RCU_APB1EN_TIMER1EN == RCU_APB1RST_TIMER1RST
               && RCU_APB1EN_TIMER2EN == RCU_APB1RST_TIMER2RST
               && RCU_APB1EN_TIMER3EN == RCU_APB1RST_TIMER3RST
               && RCU_APB1EN_TIMER4EN == RCU_APB1RST_TIMER4RST
               && RCU_APB1EN_TIMER22EN == RCU_APB1RST_TIMER22RST
               && RCU_APB2EN_TIMER7EN == RCU_APB2RST_TIMER7RST
               && RCU_APB2EN_USART0EN == RCU_APB2RST_USART0RST
               && RCU_APB2EN_ADC0EN == RCU_APB2RST_ADC0RST
               && RCU_APB2EN_ADC1EN == RCU_APB2RST_ADC1RST
               && RCU_APB2EN_ADC2EN == RCU_APB2RST_ADC2RST,
               "GD32H7 clock/reset bit positions mismatch");

#endif // gd32h7.h
